In [ ]:
import pandas as pd
from datetime import datetime
import os
import re
from pyspark.sql import SparkSession
from pyspark.sql.types import IntegerType, StringType
from pyspark.sql.functions import udf, col, count, when, isnan, create_map, lit
from pyspark.sql.functions import year, month, dayofmonth, hour, weekofyear, date_format
import pyspark.sql.functions as F
from itertools import chain
import datetime
from pyspark.sql import Window

In [2]:
data_dir = "../../data/18-83510-I94-Data-2016/"
files = os.listdir(data_dir)

for i in range(len(files)):
    file_path = data_dir + files[i]
    print(file_path)

../../data/18-83510-I94-Data-2016/i94_apr16_sub.sas7bdat
../../data/18-83510-I94-Data-2016/i94_sep16_sub.sas7bdat
../../data/18-83510-I94-Data-2016/i94_nov16_sub.sas7bdat
../../data/18-83510-I94-Data-2016/i94_mar16_sub.sas7bdat
../../data/18-83510-I94-Data-2016/i94_jun16_sub.sas7bdat
../../data/18-83510-I94-Data-2016/i94_aug16_sub.sas7bdat
../../data/18-83510-I94-Data-2016/i94_may16_sub.sas7bdat
../../data/18-83510-I94-Data-2016/i94_jan16_sub.sas7bdat
../../data/18-83510-I94-Data-2016/i94_oct16_sub.sas7bdat
../../data/18-83510-I94-Data-2016/i94_jul16_sub.sas7bdat
../../data/18-83510-I94-Data-2016/i94_feb16_sub.sas7bdat
../../data/18-83510-I94-Data-2016/i94_dec16_sub.sas7bdat

In [3]:
files

['i94_apr16_sub.sas7bdat',
 'i94_sep16_sub.sas7bdat',
 'i94_nov16_sub.sas7bdat',
 'i94_mar16_sub.sas7bdat',
 'i94_jun16_sub.sas7bdat',
 'i94_aug16_sub.sas7bdat',
 'i94_may16_sub.sas7bdat',
 'i94_jan16_sub.sas7bdat',
 'i94_oct16_sub.sas7bdat',
 'i94_jul16_sub.sas7bdat',
 'i94_feb16_sub.sas7bdat',
 'i94_dec16_sub.sas7bdat']

In [4]:
spark = SparkSession.builder.\
config("spark.jars.packages","saurfang:spark-sas7bdat:2.0.0-s_2.11")\
.enableHiveSupport().getOrCreate()

In [5]:
df_spark =spark.read.format('com.github.saurfang.sas.spark').load(data_dir + files[0])
df_spark.write.partitionBy('i94mon').parquet("data/sas_data/", 'overwrite')

In [17]:
for i in range(len(files)):
    df_spark =spark.read.format('com.github.saurfang.sas.spark').load(data_dir + files[i+1])
    df_spark.write.partitionBy('i94mon').parquet("data/sas_data/", 'append')

IndexError: list index out of range

In [24]:
df_spark1 =spark.read.format('com.github.saurfang.sas.spark').load(data_dir + files[0])
df_spark2 =spark.read.format('com.github.saurfang.sas.spark').load(data_dir + files[1])

In [25]:
assert df_spark1.columns == df_spark2.columns

In [5]:
dfImmig=spark.read.parquet("data/sas_data/")

In [6]:
dfImmig.count()

3096313

In [7]:
dfImmig.limit(5).toPandas()

,cicid,i94yr,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,...,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype,i94mon
0,5748517.0,2016.0,245.0,438.0,LOS,20574.0,1.0,CA,20582.0,40.0,...,M,1976.0,10292016,F,None,QF,9.495387e+10,00011,B1,4.0
1,5748518.0,2016.0,245.0,438.0,LOS,20574.0,1.0,NV,20591.0,32.0,...,M,1984.0,10292016,F,None,VA,9.495562e+10,00007,B1,4.0
2,5748519.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20582.0,29.0,...,M,1987.0,10292016,M,None,DL,9.495641e+10,00040,B1,4.0
3,5748520.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20588.0,29.0,...,M,1987.0,10292016,F,None,DL,9.495645e+10,00040,B1,4.0
4,5748521.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20588.0,28.0,...,M,1988.0,10292016,M,None,DL,9.495639e+10,00040,B1,4.0

In [8]:
dfImmig.columns

['cicid',
 'i94yr',
 'i94cit',
 'i94res',
 'i94port',
 'arrdate',
 'i94mode',
 'i94addr',
 'depdate',
 'i94bir',
 'i94visa',
 'count',
 'dtadfile',
 'visapost',
 'occup',
 'entdepa',
 'entdepd',
 'entdepu',
 'matflag',
 'biryear',
 'dtaddto',
 'gender',
 'insnum',
 'airline',
 'admnum',
 'fltno',
 'visatype',
 'i94mon']

In [9]:
dfImmig.select('i94mon').distinct().show()

+------+
|i94mon|
+------+
|   4.0|
+------+

# US Immigration Dataset

In [10]:
#dfImmig=spark.read.parquet("sas_data")
dfImmig.printSchema()
dfImmig.limit(10).toPandas()

root
 |-- cicid: double (nullable = true)
 |-- i94yr: double (nullable = true)
 |-- i94cit: double (nullable = true)
 |-- i94res: double (nullable = true)
 |-- i94port: string (nullable = true)
 |-- arrdate: double (nullable = true)
 |-- i94mode: double (nullable = true)
 |-- i94addr: string (nullable = true)
 |-- depdate: double (nullable = true)
 |-- i94bir: double (nullable = true)
 |-- i94visa: double (nullable = true)
 |-- count: double (nullable = true)
 |-- dtadfile: string (nullable = true)
 |-- visapost: string (nullable = true)
 |-- occup: string (nullable = true)
 |-- entdepa: string (nullable = true)
 |-- entdepd: string (nullable = true)
 |-- entdepu: string (nullable = true)
 |-- matflag: string (nullable = true)
 |-- biryear: double (nullable = true)
 |-- dtaddto: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- insnum: string (nullable = true)
 |-- airline: string (nullable = true)
 |-- admnum: double (nullable = true)
 |-- fltno: string (nullable = true)
 |-- visatype: string (nullable = true)
 |-- i94mon: double (nullable = true)

,cicid,i94yr,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,...,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype,i94mon
0,5748517.0,2016.0,245.0,438.0,LOS,20574.0,1.0,CA,20582.0,40.0,...,M,1976.0,10292016,F,None,QF,9.495387e+10,00011,B1,4.0
1,5748518.0,2016.0,245.0,438.0,LOS,20574.0,1.0,NV,20591.0,32.0,...,M,1984.0,10292016,F,None,VA,9.495562e+10,00007,B1,4.0
2,5748519.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20582.0,29.0,...,M,1987.0,10292016,M,None,DL,9.495641e+10,00040,B1,4.0
3,5748520.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20588.0,29.0,...,M,1987.0,10292016,F,None,DL,9.495645e+10,00040,B1,4.0
4,5748521.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20588.0,28.0,...,M,1988.0,10292016,M,None,DL,9.495639e+10,00040,B1,4.0
5,5748522.0,2016.0,245.0,464.0,HHW,20574.0,1.0,HI,20579.0,57.0,...,M,1959.0,10292016,M,None,NZ,9.498180e+10,00010,B2,4.0
6,5748523.0,2016.0,245.0,464.0,HHW,20574.0,1.0,HI,20586.0,66.0,...,M,1950.0,10292016,F,None,NZ,9.497969e+10,00010,B2,4.0
7,5748524.0,2016.0,245.0,464.0,HHW,20574.0,1.0,HI,20586.0,41.0,...,M,1975.0,10292016,F,None,NZ,9.497975e+10,00010,B2,4.0
8,5748525.0,2016.0,245.0,464.0,HOU,20574.0,1.0,FL,20581.0,27.0,...,M,1989.0,10292016,M,None,NZ,9.497325e+10,00028,B2,4.0
9,5748526.0,2016.0,245.0,464.0,LOS,20574.0,1.0,CA,20581.0,26.0,...,M,1990.0,10292016,F,None,NZ,9.501355e+10,00002,B2,4.0

In [12]:
dfImmig.select([count(when(isnan(c) | col(c).isNull(), c)).alias(c) for c in dfImmig.columns]).toPandas()

,cicid,i94yr,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,...,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype,i94mon
0,0,0,0,0,0,0,239,152592,142457,802,...,138429,802,477,414269,2982605,83627,0,19549,0,0

In [13]:
dfImmig.count()

3096313

In [14]:
dfImmig.dropDuplicates().count()

3096313

In [144]:
with open('I94_SAS_Labels_Descriptions.SAS') as f:
    labels = f.readlines()
    
lines = [label for label in labels if '/*' in label and '*/\n' in label]
PATTERN = '^/\*\s+(?P<code>.+?)\s+-\s+(?P<description>.+)\s+\*/$'
match = [re.search(PATTERN, l) for l in lines]

for lab in match:
    print(lab.group("code") +" : "+ lab.group("description"))

I94YR : 4 digit year
I94MON : Numeric month
I94CIT & I94RES : This format shows all the valid and invalid codes for processing
I94PORT : This format shows all the valid and invalid codes for processing
I94MODE : There are missing values as well as not reported (9)
I94BIR : Age of Respondent in Years
COUNT : Used for summary statistics
DTADFILE : Character Date Field - Date added to I-94 Files - CIC does not use
VISAPOST : Department of State where where Visa was issued - CIC does not use
OCCUP : Occupation that will be performed in U.S. - CIC does not use
ENTDEPA : Arrival Flag - admitted or paroled into the U.S. - CIC does not use
ENTDEPD : Departure Flag - Departed, lost I-94 or is deceased - CIC does not use
ENTDEPU : Update Flag - Either apprehended, overstayed, adjusted to perm residence - CIC does not use
MATFLAG : Match flag - Match of arrival and departure records
BIRYEAR : 4 digit year of birth
DTADDTO : Character Date Field - Date to which admitted to U.S. (allowed to stay until) - CIC does not use
GENDER : Non-immigrant sex
INSNUM : INS number
AIRLINE : Airline used to arrive in U.S.
ADMNUM : Admission Number
FLTNO : Flight number of Airline used to arrive in U.S.
VISATYPE : Class of admission legally admitting the non-immigrant to temporarily stay in U.S.

In [145]:
PORT_PATTERN = re.compile(r"^\s*'(?P<code>...?)'\s*=\s*'(?P<name>.+)'.*$")
valid_ports = {}

for lab in labels[302:961]:
    matches = PORT_PATTERN.match(lab) 
    valid_ports.update({matches.group('code'): matches.group('name').strip().split(",")[0]})

In [146]:
#valid_ports

In [147]:
COUNTRY_PATT = re.compile(r"^\s*(\d+)\s*=\s*'(.*?)'")
valid_country = {}

for lab in labels[9:298]:
    country = COUNTRY_PATT.search(lab) 
    valid_country.update({int(country.group(1)): country.group(2)})

In [148]:
ADDRESS_PATT = re.compile(r"^\s*'(.*?)'\s*=\s*'(.*?)'")#\s*([""'])(?:(?=(\\?))\2.)*?\1.*$''')
valid_address = {}
for lab in labels[981:1036]:
    country = ADDRESS_PATT.search(lab) 
    valid_address.update({country.group(1): country.group(2)})

In [180]:
STATE_PATTERN = re.compile(r"^\s*'(?P<code>...?)'\s*=\s*'(?P<name>.+)'.*$")
valid_states = {}

for lab in labels[302:961]:
    matches = STATE_PATTERN.match(lab) 
    #print(matches.group('name'))
    if (len(matches.group('name').strip().split(","))) < 2:
        continue
    else:
        #print(matches.group('name').strip().split(",")[1].strip())
        valid_states.update({matches.group('code'): matches.group('name').strip().split(",")[1].strip()})

In [181]:
#valid_states

In [182]:
mapping_expr = create_map([lit(x) for x in chain(*valid_country.items())])
                          
mapping_expr1 = create_map([lit(x) for x in chain(*valid_ports.items())])

mapping_expr2 = create_map([lit(x) for x in chain(*valid_address.items())])

mapping_expr3 = create_map([lit(x) for x in chain(*valid_states.items())])

In [16]:
epoch = datetime.datetime(1960, 1, 1)
sas_to_dt = udf(lambda s: (epoch + datetime.timedelta(days=int(s))).isoformat() if s is not None else None)

In [187]:
dfImmig = dfImmig.withColumn('arrival_date', sas_to_dt('arrdate'))\
                .withColumn('departure_date', sas_to_dt('depdate'))\
                .withColumn("origin_country", mapping_expr.getItem(col("i94res")))\
                .withColumn("port", mapping_expr1.getItem(col("i94port")))\
                .withColumn("address", mapping_expr2.getItem(col("i94addr")))\
                .withColumn('duration_of_stay', F.datediff('departure_date', 'arrival_date'))\
                .withColumn('us_state', mapping_expr3.getItem(col("i94port")))\
                .withColumn('us_state', mapping_expr2.getItem(col("us_state")))

In [183]:
dfImmig = dfImmig.withColumn('us_state', mapping_expr3.getItem(col("i94port")))

In [184]:
dfImmig = dfImmig.withColumn('us_state_1', mapping_expr2.getItem(col("us_state")))

In [18]:
dfImmig = dfImmig.withColumn('visa_purpose', F.when(col('i94visa')==1.0, 'business')\
                    .when(col('i94visa') ==2.0, 'pleasure')\
                    .when(col('i94visa') ==3.0, 'student').otherwise(None))

In [19]:
dfImmig = dfImmig.withColumn('arrival_mode', F.when(col('i94mode')==1.0, 'air')\
                    .when(col('i94mode') ==2.0, 'sea')\
                    .when(col('i94mode') ==3.0, 'land')\
                    .when(col('i94mode') ==9.0, 'not reported')\
                    .otherwise(None))

In [20]:
dfImmig = dfImmig.withColumn('port_type', F.when(col('i94mode')==1.0, 'airport')\
                    .when(col('i94mode') ==2.0, 'seaport')\
                    .when(col('i94mode') ==3.0, 'landport')\
                    .when(col('i94mode') ==9.0, 'not reported')\
                    .otherwise(None))

In [188]:
dfImmig.limit(10).toPandas()

,cicid,i94yr,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,...,departure_date,origin_country,port,address,duration_of_stay,visa_purpose,arrival_mode,port_type,us_state,us_state_1
0,5748517.0,2016.0,245.0,438.0,LOS,20574.0,1.0,CA,20582.0,40.0,...,2016-05-08T00:00:00,AUSTRALIA,LOS ANGELES,CALIFORNIA,8,business,air,airport,CALIFORNIA,CALIFORNIA
1,5748518.0,2016.0,245.0,438.0,LOS,20574.0,1.0,NV,20591.0,32.0,...,2016-05-17T00:00:00,AUSTRALIA,LOS ANGELES,NEVADA,17,business,air,airport,CALIFORNIA,CALIFORNIA
2,5748519.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20582.0,29.0,...,2016-05-08T00:00:00,AUSTRALIA,LOS ANGELES,WASHINGTON,8,business,air,airport,CALIFORNIA,CALIFORNIA
3,5748520.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20588.0,29.0,...,2016-05-14T00:00:00,AUSTRALIA,LOS ANGELES,WASHINGTON,14,business,air,airport,CALIFORNIA,CALIFORNIA
4,5748521.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20588.0,28.0,...,2016-05-14T00:00:00,AUSTRALIA,LOS ANGELES,WASHINGTON,14,business,air,airport,CALIFORNIA,CALIFORNIA
5,5748522.0,2016.0,245.0,464.0,HHW,20574.0,1.0,HI,20579.0,57.0,...,2016-05-05T00:00:00,NEW ZEALAND,HONOLULU,HAWAII,5,pleasure,air,airport,HAWAII,HAWAII
6,5748523.0,2016.0,245.0,464.0,HHW,20574.0,1.0,HI,20586.0,66.0,...,2016-05-12T00:00:00,NEW ZEALAND,HONOLULU,HAWAII,12,pleasure,air,airport,HAWAII,HAWAII
7,5748524.0,2016.0,245.0,464.0,HHW,20574.0,1.0,HI,20586.0,41.0,...,2016-05-12T00:00:00,NEW ZEALAND,HONOLULU,HAWAII,12,pleasure,air,airport,HAWAII,HAWAII
8,5748525.0,2016.0,245.0,464.0,HOU,20574.0,1.0,FL,20581.0,27.0,...,2016-05-07T00:00:00,NEW ZEALAND,HOUSTON,FLORIDA,7,pleasure,air,airport,TEXAS,TEXAS
9,5748526.0,2016.0,245.0,464.0,LOS,20574.0,1.0,CA,20581.0,26.0,...,2016-05-07T00:00:00,NEW ZEALAND,LOS ANGELES,CALIFORNIA,7,pleasure,air,airport,CALIFORNIA,CALIFORNIA

In [189]:
dfImmig.columns

['cicid',
 'i94yr',
 'i94cit',
 'i94res',
 'i94port',
 'arrdate',
 'i94mode',
 'i94addr',
 'depdate',
 'i94bir',
 'i94visa',
 'count',
 'dtadfile',
 'visapost',
 'occup',
 'entdepa',
 'entdepd',
 'entdepu',
 'matflag',
 'biryear',
 'dtaddto',
 'gender',
 'insnum',
 'airline',
 'admnum',
 'fltno',
 'visatype',
 'i94mon',
 'arrival_date',
 'departure_date',
 'origin_country',
 'port',
 'address',
 'duration_of_stay',
 'visa_purpose',
 'arrival_mode',
 'port_type',
 'us_state',
 'us_state_1']

In [22]:
dfImmig.limit(5).toPandas()

,cicid,i94yr,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,...,i94mon,arrival_date,departure_date,origin_country,port,address,duration_of_stay,visa_purpose,arrival_mode,port_type
0,5748517.0,2016.0,245.0,438.0,LOS,20574.0,1.0,CA,20582.0,40.0,...,4.0,2016-04-30T00:00:00,2016-05-08T00:00:00,AUSTRALIA,LOS ANGELES,CALIFORNIA,8,business,air,airport
1,5748518.0,2016.0,245.0,438.0,LOS,20574.0,1.0,NV,20591.0,32.0,...,4.0,2016-04-30T00:00:00,2016-05-17T00:00:00,AUSTRALIA,LOS ANGELES,NEVADA,17,business,air,airport
2,5748519.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20582.0,29.0,...,4.0,2016-04-30T00:00:00,2016-05-08T00:00:00,AUSTRALIA,LOS ANGELES,WASHINGTON,8,business,air,airport
3,5748520.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20588.0,29.0,...,4.0,2016-04-30T00:00:00,2016-05-14T00:00:00,AUSTRALIA,LOS ANGELES,WASHINGTON,14,business,air,airport
4,5748521.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20588.0,28.0,...,4.0,2016-04-30T00:00:00,2016-05-14T00:00:00,AUSTRALIA,LOS ANGELES,WASHINGTON,14,business,air,airport

In [34]:
dfImmig.groupBy('arrival_mode').count().show()

+------------+-------+
|arrival_mode|  count|
+------------+-------+
|         sea|  26349|
|        null|    239|
|        land|  66660|
|not reported|   8560|
|         air|2994505|
+------------+-------+

### Create Immigrant Dimension Table

In [23]:
dim_immigrant_table = dfImmig.select(col('i94bir').alias('age').cast(IntegerType()), col('gender'), col('arrival_date'),
                                 col('departure_date'), col('visatype'), col('visa_purpose'), 
                                  col('origin_country'), col('arrival_mode'), col('duration_of_stay'),
                                  col('port').alias('port_of_entry'), col('address'),
                                 col('i94port').alias('port'), 'occup', 'i94res')

In [36]:
dim_immigrant_table.limit(10).toPandas()

,age,gender,arrival_date,departure_date,visatype,visa_purpose,origin_country,arrival_mode,duration_of_stay,port_of_entry,address,port,occup,i94res
0,40,F,2016-04-30T00:00:00,2016-05-08T00:00:00,B1,business,AUSTRALIA,air,8,LOS ANGELES,CALIFORNIA,LOS,None,438.0
1,32,F,2016-04-30T00:00:00,2016-05-17T00:00:00,B1,business,AUSTRALIA,air,17,LOS ANGELES,NEVADA,LOS,None,438.0
2,29,M,2016-04-30T00:00:00,2016-05-08T00:00:00,B1,business,AUSTRALIA,air,8,LOS ANGELES,WASHINGTON,LOS,None,438.0
3,29,F,2016-04-30T00:00:00,2016-05-14T00:00:00,B1,business,AUSTRALIA,air,14,LOS ANGELES,WASHINGTON,LOS,None,438.0
4,28,M,2016-04-30T00:00:00,2016-05-14T00:00:00,B1,business,AUSTRALIA,air,14,LOS ANGELES,WASHINGTON,LOS,None,438.0
5,57,M,2016-04-30T00:00:00,2016-05-05T00:00:00,B2,pleasure,NEW ZEALAND,air,5,HONOLULU,HAWAII,HHW,None,464.0
6,66,F,2016-04-30T00:00:00,2016-05-12T00:00:00,B2,pleasure,NEW ZEALAND,air,12,HONOLULU,HAWAII,HHW,None,464.0
7,41,F,2016-04-30T00:00:00,2016-05-12T00:00:00,B2,pleasure,NEW ZEALAND,air,12,HONOLULU,HAWAII,HHW,None,464.0
8,27,M,2016-04-30T00:00:00,2016-05-07T00:00:00,B2,pleasure,NEW ZEALAND,air,7,HOUSTON,FLORIDA,HOU,None,464.0
9,26,F,2016-04-30T00:00:00,2016-05-07T00:00:00,B2,pleasure,NEW ZEALAND,air,7,LOS ANGELES,CALIFORNIA,LOS,None,464.0

In [37]:
#dim_immigrant_table.select('occup').distinct().toPandas()

#### Check if there are any negative duration of stay and filter them out

In [38]:
dim_immigrant_table.filter(col('duration_of_stay') < 0).count()

375

#### We need the duration of stay which has None value, as we don't know if the immigrant left US to another destination or stayed in the US

In [24]:
dim_immigrant_table = dim_immigrant_table.filter((col('duration_of_stay') > 0) | (col('duration_of_stay').isNull()))

In [25]:
dim_immigrant_table.write.partitionBy('port_of_entry').parquet("output_data/dim_immigrant_table/", 'overwrite')

### Create Port Dimension Table

In [41]:
#dfImmig.columns

### Create Port Dimension Table

In [191]:
dim_port_table = dfImmig.select(
    'i94port',
    col('port').alias('port_city'),
    'us_state')

dim_port_table.limit(5).toPandas()

  i94port    port_city    us_state
0     LOS  LOS ANGELES  CALIFORNIA
1     LOS  LOS ANGELES  CALIFORNIA
2     LOS  LOS ANGELES  CALIFORNIA
3     LOS  LOS ANGELES  CALIFORNIA
4     LOS  LOS ANGELES  CALIFORNIA

In [43]:
dim_port_table.write.partitionBy('port_city').parquet("output_data/dim_port_table/", 'overwrite')

### Create Date Dimension Table

In [27]:
dim_date_table = dfImmig.select(
                    'arrival_date',
                    'departure_date',
                    dayofmonth("arrival_date").alias('arrival_day'),
                    weekofyear("arrival_date").alias('arrival_week'),
                    month("arrival_date").alias('arrival_month'),
                    year("arrival_date").alias('arrival_year'),
                    date_format("arrival_date", "E").alias("arrival_weekday"),
                    dayofmonth("departure_date").alias('departure_day'),
                    weekofyear("departure_date").alias('departure_week'),
                    month("departure_date").alias('departure_month'),
                    year("departure_date").alias('departure_year'),
                    date_format("departure_date", "E").alias("departure_weekday")
                )

In [45]:
dim_date_table.write.parquet("output_data/dim_date_table/", 'overwrite')

In [46]:
dim_date_table.limit(5).toPandas()

,arrival_date,departure_date,arrival_day,arrival_week,arrival_month,arrival_year,arrival_weekday,departure_day,departure_week,departure_month,departure_year,departure_weekday
0,2016-04-30T00:00:00,2016-05-08T00:00:00,30,17,4,2016,Sat,8,18,5,2016,Sun
1,2016-04-30T00:00:00,2016-05-17T00:00:00,30,17,4,2016,Sat,17,20,5,2016,Tue
2,2016-04-30T00:00:00,2016-05-08T00:00:00,30,17,4,2016,Sat,8,18,5,2016,Sun
3,2016-04-30T00:00:00,2016-05-14T00:00:00,30,17,4,2016,Sat,14,19,5,2016,Sat
4,2016-04-30T00:00:00,2016-05-14T00:00:00,30,17,4,2016,Sat,14,19,5,2016,Sat

In [ ]:
dim_date_table.write.parquet("output_data/dim_date_table/", 'overwrite')

# US Demography Dataset

In [28]:
df_city_demograph = spark.read.option("sep", ";").csv("/home/workspace/us-cities-demographics.csv", header=True)
df_city_demograph.limit(5).toPandas()

,City,State,Median Age,Male Population,Female Population,Total Population,Number of Veterans,Foreign-born,Average Household Size,State Code,Race,Count
0,Silver Spring,Maryland,33.8,40601,41862,82463,1562,30908,2.6,MD,Hispanic or Latino,25924
1,Quincy,Massachusetts,41.0,44129,49500,93629,4147,32935,2.39,MA,White,58723
2,Hoover,Alabama,38.5,38040,46799,84839,4819,8229,2.58,AL,Asian,4759
3,Rancho Cucamonga,California,34.5,88127,87105,175232,5821,33878,3.18,CA,Black or African-American,24437
4,Newark,New Jersey,34.6,138040,143873,281913,5829,86253,2.73,NJ,White,76402

#### Make the string in the column *City* all capitals in order to achieve consistency

In [29]:
df_city_demograph = df_city_demograph.withColumn('City', F.upper(col('City')))

#### Check of null value in the each columns of the Dataframe

In [49]:
df_city_demograph.select([count(when(isnan(cc) | col(cc).isNull(), cc)).alias(cc) for cc in df_city_demograph.columns]).toPandas()

,City,State,Median Age,Male Population,Female Population,Total Population,Number of Veterans,Foreign-born,Average Household Size,State Code,Race,Count
0,0,0,0,3,3,0,13,13,16,0,0,0

In [30]:
df_city_demograph.filter(col('Male Population').isNull()).toPandas()

,City,State,Median Age,Male Population,Female Population,Total Population,Number of Veterans,Foreign-born,Average Household Size,State Code,Race,Count
0,THE VILLAGES,Florida,70.5,None,None,72590,15231,4034,None,FL,Hispanic or Latino,1066
1,THE VILLAGES,Florida,70.5,None,None,72590,15231,4034,None,FL,Black or African-American,331
2,THE VILLAGES,Florida,70.5,None,None,72590,15231,4034,None,FL,White,72211

In [31]:
df_city_demograph.filter(col('Female Population').isNull()).toPandas()

,City,State,Median Age,Male Population,Female Population,Total Population,Number of Veterans,Foreign-born,Average Household Size,State Code,Race,Count
0,THE VILLAGES,Florida,70.5,None,None,72590,15231,4034,None,FL,Hispanic or Latino,1066
1,THE VILLAGES,Florida,70.5,None,None,72590,15231,4034,None,FL,Black or African-American,331
2,THE VILLAGES,Florida,70.5,None,None,72590,15231,4034,None,FL,White,72211

### Create US Demography Dimension Table

In [32]:
dim_usdemograph_table = df_city_demograph.select(F.upper(col('City')).alias('city'), 
                                              F.upper(col('State')).alias('state'), 
                                              col('Male Population').alias('male_poulation'), 
                                              col('Female Population').alias('female_population'), 
                                              col('Total Population').alias('total_population'), 
                                              col('Median Age').alias('median_age').cast(IntegerType()), 
                                              col('Foreign-born').alias('foreign_born'), 
                                              col('Number of Veterans').alias('no_of_veterans'), 
                                              col('Race').alias('ethnicity'), 
                                              col('Count').alias('ethinicity_count'))

In [60]:
dim_usdemograph_table.limit(5).toPandas()

,city,state,male_poulation,female_population,total_population,median_age,foreign_born,no_of_veterans,ethnicity,ethinicity_count
0,SILVER SPRING,MARYLAND,40601,41862,82463,33,30908,1562,Hispanic or Latino,25924
1,QUINCY,MASSACHUSETTS,44129,49500,93629,41,32935,4147,White,58723
2,HOOVER,ALABAMA,38040,46799,84839,38,8229,4819,Asian,4759
3,RANCHO CUCAMONGA,CALIFORNIA,88127,87105,175232,34,33878,5821,Black or African-American,24437
4,NEWARK,NEW JERSEY,138040,143873,281913,34,86253,5829,White,76402

In [41]:
dim_usdemograph_table.write.partitionBy('state', 'city').parquet("output_data/dim_usdemograph_table/", 'overwrite')

### Create a dictionary of city and state in the US

In [75]:
#dict(dim_usdemograph_table.rdd.map(lambda x: (x['state'], x['city'])).collect())

# Airport Codes Dataset

In [33]:
df_airport = spark.read.csv("/home/workspace/airport-codes_csv.csv", header=True)
df_airport.limit(10).toPandas()

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
0,00A,heliport,Total Rf Heliport,11,NA,US,US-PA,Bensalem,00A,None,00A,"-74.93360137939453, 40.07080078125"
1,00AA,small_airport,Aero B Ranch Airport,3435,NA,US,US-KS,Leoti,00AA,None,00AA,"-101.473911, 38.704022"
2,00AK,small_airport,Lowell Field,450,NA,US,US-AK,Anchor Point,00AK,None,00AK,"-151.695999146, 59.94919968"
3,00AL,small_airport,Epps Airpark,820,NA,US,US-AL,Harvest,00AL,None,00AL,"-86.77030181884766, 34.86479949951172"
4,00AR,closed,Newport Hospital & Clinic Heliport,237,NA,US,US-AR,Newport,None,None,None,"-91.254898, 35.6087"
5,00AS,small_airport,Fulton Airport,1100,NA,US,US-OK,Alex,00AS,None,00AS,"-97.8180194, 34.9428028"
6,00AZ,small_airport,Cordes Airport,3810,NA,US,US-AZ,Cordes,00AZ,None,00AZ,"-112.16500091552734, 34.305599212646484"
7,00CA,small_airport,Goldstone /Gts/ Airport,3038,NA,US,US-CA,Barstow,00CA,None,00CA,"-116.888000488, 35.350498199499995"
8,00CL,small_airport,Williams Ag Airport,87,NA,US,US-CA,Biggs,00CL,None,00CL,"-121.763427, 39.427188"
9,00CN,heliport,Kitchen Creek Helibase Heliport,3350,NA,US,US-CA,Pine Valley,00CN,None,00CN,"-116.4597417, 32.7273736"

In [66]:
df_airport.count()

55075

In [65]:
df_airport.select('ident').distinct().count()

55075

In [62]:
df_airport.select('iso_country').distinct().show()

+-----------+
|iso_country|
+-----------+
|         DZ|
|         LT|
|         MM|
|         CI|
|         TC|
|         AZ|
|         FI|
|         SC|
|         PM|
|         UA|
|         ZM|
|         KI|
|         RO|
|         SL|
|         SB|
|         NL|
|         LA|
|         BS|
|         BW|
|         MN|
+-----------+
only showing top 20 rows

In [63]:
df_airport.select('iata_code').distinct().show()

+---------+
|iata_code|
+---------+
|      BZT|
|      YUL|
|      DWR|
|      NWI|
|      KLR|
|      KMU|
|      KGL|
|      HYL|
|      BGM|
|      CNU|
|      CRS|
|      KEB|
|      FMY|
|      LEB|
|      OXC|
|      RKP|
|      SGT|
|      TNP|
|      LEN|
|      PMI|
+---------+
only showing top 20 rows

In [43]:
df_airport.count()

55075

In [44]:
df_airport.dropDuplicates().count()

55075

#### Check for null value in the each columns of the Dataframe

In [45]:
df_airport.select([count(when(isnan(cc) | col(cc).isNull(), cc)).alias(cc) for cc in df_airport.columns]).toPandas()

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
0,0,0,0,7006,0,0,0,5676,14045,45886,26389,0

#### Filter out the airports in USA

In [34]:
dff = df_airport.filter(col('iso_country') == 'US')

In [35]:
dff.count()

22757

In [36]:
dff.select('ident').distinct().toPandas()

         ident
0         06IN
1         06VA
2         0LA0
3         0MD6
4         0OH7
5         0OK9
6         11KS
7         16KY
8         19OI
9         19OR
10        1CL8
11        1GE5
12        1IN1
13        1TE0
14         20E
15        20ND
16        23AR
17        27AR
18        29VT
19        2GE4
20        2LA2
21        2LA4
22        2OI6
23        36FA
24        38LL
25        3AK4
26        3MO3
27         3RU
28        3XS0
29        41NC
...        ...
22727     LS60
22728     MA11
22729     MA45
22730     MY55
22731     MY92
22732     NC58
22733     NK50
22734     OH22
22735     OI85
22736     OVER
22737     PA44
22738     PACS
22739     SN21
22740     SN90
22741      T48
22742     TN48
22743     TN56
22744     TN88
22745     TN92
22746     TX43
22747  US-0285
22748  US-0331
22749  US-0383
22750  US-0558
22751  US-0820
22752     VA15
22753     VG11
22754     WA25
22755     WN25
22756      Y91

[22757 rows x 1 columns]

#### Split the string in the column *iso_region* to get the US States

In [37]:
dff = dff.withColumn('state', F.split(col('iso_region'), '-').getItem(1))
#dff = dff.withColumn("address", mapping_expr2.getItem(col("city")))

In [38]:
dff = dff.withColumn("port_state", mapping_expr2.getItem(col("state")))

#### Filter off the values where the address is None

In [39]:
dff = dff.filter(col('port_state').isNotNull())

In [40]:
dim_usairport_table = dff.select(col('ident'),
                          col('type'),
                          col('name'),
                          col('elevation_ft'),
                          col('iata_code'),
                          col('local_code'),
                          col('coordinates'),
                          col('iso_region'),
                          col('port_state'))

In [41]:
dim_usairport_table = dim_usairport_table.withColumn('port_type', F.lit('airport'))

In [42]:
dim_usairport_table.limit(5).toPandas()

,ident,type,name,elevation_ft,iata_code,local_code,coordinates,iso_region,port_state,port_type
0,00A,heliport,Total Rf Heliport,11,None,00A,"-74.93360137939453, 40.07080078125",US-PA,PENNSYLVANIA,airport
1,00AA,small_airport,Aero B Ranch Airport,3435,None,00AA,"-101.473911, 38.704022",US-KS,KANSAS,airport
2,00AK,small_airport,Lowell Field,450,None,00AK,"-151.695999146, 59.94919968",US-AK,ALASKA,airport
3,00AL,small_airport,Epps Airpark,820,None,00AL,"-86.77030181884766, 34.86479949951172",US-AL,ALABAMA,airport
4,00AR,closed,Newport Hospital & Clinic Heliport,237,None,None,"-91.254898, 35.6087",US-AR,ARKANSAS,airport

In [43]:
dim_usairport_table.select('ident').distinct().count()

22747

In [62]:
dim_usairport_table.write.partitionBy('port_state').parquet("output_data/dim_usairport_table/", 'overwrite')

# World Temperature Data

In [71]:
df_spark_temp =spark.read.csv('../../data2/GlobalLandTemperaturesByCity.csv', header=True)
df_spark_temp.limit(5).toPandas()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.7369999999999999,Århus,Denmark,57.05N,10.33E
1,1743-12-01,None,None,Århus,Denmark,57.05N,10.33E
2,1744-01-01,None,None,Århus,Denmark,57.05N,10.33E
3,1744-02-01,None,None,Århus,Denmark,57.05N,10.33E
4,1744-03-01,None,None,Århus,Denmark,57.05N,10.33E

In [72]:
df_spark_temp = df_spark_temp.withColumn('AverageTemperature', F.round(col('AverageTemperature'), 3))\
                                .withColumn('AverageTemperatureUncertainty', F.round(col('AverageTemperatureUncertainty'), 3))
df_spark_temp.limit(5).toPandas()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E

In [81]:
df_spark_temp.select([count(when(isnan(cc) | col(cc).isNull(), cc)).alias(cc) for cc in df_spark_temp.columns]).toPandas()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,0,364130,364130,0,0,0,0

In [73]:
df_spark_temp = df_spark_temp.withColumn('city', F.upper(col('City')))
df_spark_temp.limit(5).toPandas()

,dt,AverageTemperature,AverageTemperatureUncertainty,city,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,ÅRHUS,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,ÅRHUS,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,ÅRHUS,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,ÅRHUS,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,ÅRHUS,Denmark,57.05N,10.33E

###  Create US Temperature Dimension Table

In [74]:
dim_ustemperature_table = df_spark_temp.filter(df_spark_temp.Country.contains('United States'))
dim_ustemperature_table = dim_ustemperature_table.withColumnRenamed('city', 'us_city')
dim_ustemperature_table.limit(5).toPandas()

,dt,AverageTemperature,AverageTemperatureUncertainty,us_city,Country,Latitude,Longitude
0,1820-01-01,2.101,3.217,ABILENE,United States,32.95N,100.53W
1,1820-02-01,6.926,2.853,ABILENE,United States,32.95N,100.53W
2,1820-03-01,10.767,2.395,ABILENE,United States,32.95N,100.53W
3,1820-04-01,17.989,2.202,ABILENE,United States,32.95N,100.53W
4,1820-05-01,21.809,2.036,ABILENE,United States,32.95N,100.53W

In [48]:
dim_ustemperature_table.select('us_city').distinct().count()

248

In [85]:
dim_ustemperature_table.count()

687289

In [86]:
dim_ustemperature_table.filter(col('AverageTemperature').isNull()).count()

25765

In [75]:
dim_ustemperature_table = dim_ustemperature_table.dropna()

In [88]:
dim_ustemperature_table.count()

661524

In [89]:
dim_ustemperature_table.select([count(when(isnan(cc) | col(cc).isNull(), cc)).alias(cc) for cc in dim_ustemperature_table.columns]).toPandas()

,dt,AverageTemperature,AverageTemperatureUncertainty,us_city,Country,Latitude,Longitude
0,0,0,0,0,0,0,0

In [72]:
dim_ustemperature_table.write.partitionBy('us_city').parquet("output_data/dim_ustemperature_table/", 'overwrite')

In [50]:
#some_tab
#dim_ustemperature_table= dim_ustemperature_table.join(dim_usdemograph_table, (dim_ustemperature_table.us_city == dim_usdemograph_table.city))\
#        .select(col('dt'), col('AverageTemperature'), col('AverageTemperatureUncertainty'), 
#                col('us_city'), col('state'), col('Country'), col('Latitude'), col('Longitude'))

In [51]:
dim_ustemperature_table = dim_ustemperature_table.dropDuplicates()
#some_tab = some_tab.dropna()

In [76]:
dim_ustemperature_table.count()

661524

In [77]:
dim_ustemperature_table.limit(10).toPandas()

,dt,AverageTemperature,AverageTemperatureUncertainty,us_city,Country,Latitude,Longitude
0,1820-01-01,2.101,3.217,ABILENE,United States,32.95N,100.53W
1,1820-02-01,6.926,2.853,ABILENE,United States,32.95N,100.53W
2,1820-03-01,10.767,2.395,ABILENE,United States,32.95N,100.53W
3,1820-04-01,17.989,2.202,ABILENE,United States,32.95N,100.53W
4,1820-05-01,21.809,2.036,ABILENE,United States,32.95N,100.53W
5,1820-06-01,25.682,2.008,ABILENE,United States,32.95N,100.53W
6,1820-07-01,26.268,1.802,ABILENE,United States,32.95N,100.53W
7,1820-08-01,25.048,1.895,ABILENE,United States,32.95N,100.53W
8,1820-09-01,22.435,2.216,ABILENE,United States,32.95N,100.53W
9,1820-10-01,15.830,2.169,ABILENE,United States,32.95N,100.53W

In [79]:
dim_ustemperature_table.filter(col('us_city') == 'ARLINGTON').limit(20).toPandas()

,dt,AverageTemperature,AverageTemperatureUncertainty,us_city,Country,Latitude,Longitude
0,1820-01-01,3.293,3.278,ARLINGTON,United States,32.95N,96.70W
1,1820-02-01,8.423,2.879,ARLINGTON,United States,32.95N,96.70W
2,1820-03-01,12.046,2.347,ARLINGTON,United States,32.95N,96.70W
3,1820-04-01,18.946,2.092,ARLINGTON,United States,32.95N,96.70W
4,1820-05-01,22.195,1.832,ARLINGTON,United States,32.95N,96.70W
5,1820-06-01,26.145,1.850,ARLINGTON,United States,32.95N,96.70W
6,1820-07-01,27.317,1.709,ARLINGTON,United States,32.95N,96.70W
7,1820-08-01,26.570,1.818,ARLINGTON,United States,32.95N,96.70W
8,1820-09-01,23.962,2.189,ARLINGTON,United States,32.95N,96.70W
9,1820-10-01,17.288,2.171,ARLINGTON,United States,32.95N,96.70W
10,1820-11-01,10.975,1.980,ARLINGTON,United States,32.95N,96.70W
11,1820-12-01,5.347,2.420,ARLINGTON,United States,32.95N,96.70W
12,1821-01-01,6.163,3.371,ARLINGTON,United States,32.95N,96.70W
13,1821-02-01,8.771,3.727,ARLINGTON,United States,32.95N,96.70W
14,1821-03-01,12.727,2.764,ARLINGTON,United States,32.95N,96.70W
15,1821-04-01,16.148,2.083,ARLINGTON,United States,32.95N,96.70W
16,1821-05-01,21.846,2.000,ARLINGTON,United States,32.95N,96.70W
17,1821-06-01,26.326,2.540,ARLINGTON,United States,32.95N,96.70W
18,1821-07-01,27.368,2.406,ARLINGTON,United States,32.95N,96.70W
19,1821-08-01,28.835,2.271,ARLINGTON,United States,32.95N,96.70W

In [54]:
dim_ustemperature_table.filter((col('dt') == '1820-01-01') & (col('us_city')== 'ABILENE')).show()

+----------+------------------+-----------------------------+-------+-----+-------------+--------+---------+
|        dt|AverageTemperature|AverageTemperatureUncertainty|us_city|state|      Country|Latitude|Longitude|
+----------+------------------+-----------------------------+-------+-----+-------------+--------+---------+
|1820-01-01|             2.101|                        3.217|ABILENE|TEXAS|United States|  32.95N|  100.53W|
+----------+------------------+-----------------------------+-------+-----+-------------+--------+---------+

In [95]:
dim_ustemperature_table.select([count(when(isnan(cc) | col(cc).isNull(), cc)).alias(cc) for cc in dim_ustemperature_table.columns]).toPandas()

,dt,AverageTemperature,AverageTemperatureUncertainty,us_city,state,Country,Latitude,Longitude
0,0,0,0,0,0,0,0,0

In [128]:
some_tab.filter(col('AverageTemperature').isNull()).limit(10).toPandas()

Empty DataFrame
Columns: [dt, AverageTemperature, AverageTemperatureUncertainty, us_city, state, Country, Latitude, Longitude]
Index: []

In [109]:
some_tab.count()

725164

In [97]:
754262 - 687289

66973

In [95]:
some_tab.dropDuplicates().count()

754262

In [94]:
some_tab.count()

3759612

In [192]:
print('*'*100)
print(dim_immigrant_table.limit(5).toPandas())
print('*'*100)
print(dim_port_table.limit(5).toPandas())
print('*'*100)
print(dim_date_table.limit(5).toPandas())
print('*'*100)
print(dim_usdemograph_table.limit(5).toPandas())
print('*'*100)
print(dim_usairport_table.limit(5).toPandas())
print('*'*100)
print(dim_ustemperature_table.limit(5).toPandas())
print('*'*100)

****************************************************************************************************
   age gender         arrival_date       departure_date visatype visa_purpose  \
0   40      F  2016-04-30T00:00:00  2016-05-08T00:00:00       B1     business
1   32      F  2016-04-30T00:00:00  2016-05-17T00:00:00       B1     business
2   29      M  2016-04-30T00:00:00  2016-05-08T00:00:00       B1     business
3   29      F  2016-04-30T00:00:00  2016-05-14T00:00:00       B1     business
4   28      M  2016-04-30T00:00:00  2016-05-14T00:00:00       B1     business

  origin_country arrival_mode  duration_of_stay port_of_entry     address  \
0      AUSTRALIA          air                 8   LOS ANGELES  CALIFORNIA
1      AUSTRALIA          air                17   LOS ANGELES      NEVADA
2      AUSTRALIA          air                 8   LOS ANGELES  WASHINGTON
3      AUSTRALIA          air                14   LOS ANGELES  WASHINGTON
4      AUSTRALIA          air                14   LOS ANGELES  WASHINGTON

  port occup  i94res
0  LOS  None   438.0
1  LOS  None   438.0
2  LOS  None   438.0
3  LOS  None   438.0
4  LOS  None   438.0
****************************************************************************************************
  i94port    port_city    us_state
0     LOS  LOS ANGELES  CALIFORNIA
1     LOS  LOS ANGELES  CALIFORNIA
2     LOS  LOS ANGELES  CALIFORNIA
3     LOS  LOS ANGELES  CALIFORNIA
4     LOS  LOS ANGELES  CALIFORNIA
****************************************************************************************************
          arrival_date       departure_date  arrival_day  arrival_week  \
0  2016-04-30T00:00:00  2016-05-08T00:00:00           30            17
1  2016-04-30T00:00:00  2016-05-17T00:00:00           30            17
2  2016-04-30T00:00:00  2016-05-08T00:00:00           30            17
3  2016-04-30T00:00:00  2016-05-14T00:00:00           30            17
4  2016-04-30T00:00:00  2016-05-14T00:00:00           30            17

   arrival_month  arrival_year arrival_weekday  departure_day  departure_week  \
0              4          2016             Sat              8              18
1              4          2016             Sat             17              20
2              4          2016             Sat              8              18
3              4          2016             Sat             14              19
4              4          2016             Sat             14              19

   departure_month  departure_year departure_weekday
0                5            2016               Sun
1                5            2016               Tue
2                5            2016               Sun
3                5            2016               Sat
4                5            2016               Sat
****************************************************************************************************
               city          state male_poulation female_population  \
0     SILVER SPRING       MARYLAND          40601             41862
1            QUINCY  MASSACHUSETTS          44129             49500
2            HOOVER        ALABAMA          38040             46799
3  RANCHO CUCAMONGA     CALIFORNIA          88127             87105
4            NEWARK     NEW JERSEY         138040            143873

  total_population  median_age foreign_born no_of_veterans  \
0            82463          33        30908           1562
1            93629          41        32935           4147
2            84839          38         8229           4819
3           175232          34        33878           5821
4           281913          34        86253           5829

                   ethnicity ethinicity_count
0         Hispanic or Latino            25924
1                      White            58723
2                      Asian             4759
3  Black or African-American            24437
4                      White            76402
****************************************************************************************************
  ident           type                                name elevation_ft  \
0   00A       heliport                   Total Rf Heliport           11
1  00AA  small_airport                Aero B Ranch Airport         3435
2  00AK  small_airport                        Lowell Field          450
3  00AL  small_airport                        Epps Airpark          820
4  00AR         closed  Newport Hospital & Clinic Heliport          237

  iata_code local_code                            coordinates iso_region  \
0      None        00A     -74.93360137939453, 40.07080078125      US-PA
1      None       00AA                 -101.473911, 38.704022      US-KS
2      None       00AK            -151.695999146, 59.94919968      US-AK
3      None       00AL  -86.77030181884766, 34.86479949951172      US-AL
4      None       None                    -91.254898, 35.6087      US-AR

     port_state port_type
0  PENNSYLVANIA   airport
1        KANSAS   airport
2        ALASKA   airport
3       ALABAMA   airport
4      ARKANSAS   airport
****************************************************************************************************
           dt  AverageTemperature  AverageTemperatureUncertainty  us_city  \
0  1820-01-01               2.101                          3.217  ABILENE
1  1820-02-01               6.926                          2.853  ABILENE
2  1820-03-01              10.767                          2.395  ABILENE
3  1820-04-01              17.989                          2.202  ABILENE
4  1820-05-01              21.809                          2.036  ABILENE

         Country Latitude Longitude
0  United States   32.95N   100.53W
1  United States   32.95N   100.53W
2  United States   32.95N   100.53W
3  United States   32.95N   100.53W
4  United States   32.95N   100.53W
****************************************************************************************************

In [96]:
dfImmig.printSchema()

root
 |-- cicid: double (nullable = true)
 |-- i94yr: double (nullable = true)
 |-- i94mon: double (nullable = true)
 |-- i94cit: double (nullable = true)
 |-- i94res: double (nullable = true)
 |-- i94port: string (nullable = true)
 |-- arrdate: double (nullable = true)
 |-- i94mode: double (nullable = true)
 |-- i94addr: string (nullable = true)
 |-- depdate: double (nullable = true)
 |-- i94bir: double (nullable = true)
 |-- i94visa: double (nullable = true)
 |-- count: double (nullable = true)
 |-- dtadfile: string (nullable = true)
 |-- visapost: string (nullable = true)
 |-- occup: string (nullable = true)
 |-- entdepa: string (nullable = true)
 |-- entdepd: string (nullable = true)
 |-- entdepu: string (nullable = true)
 |-- matflag: string (nullable = true)
 |-- biryear: double (nullable = true)
 |-- dtaddto: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- insnum: string (nullable = true)
 |-- airline: string (nullable = true)
 |-- admnum: double (nullable = true)
 |-- fltno: string (nullable = true)
 |-- visatype: string (nullable = true)
 |-- arrival_date: string (nullable = true)
 |-- departure_date: string (nullable = true)
 |-- origin_country: string (nullable = true)
 |-- port: string (nullable = true)
 |-- address: string (nullable = true)
 |-- duration_of_stay: integer (nullable = true)
 |-- visa_purpose: string (nullable = true)
 |-- arrival_mode: string (nullable = true)
 |-- port_type: string (nullable = true)

In [55]:
df_spark_temp.limit(5).toPandas()

,dt,AverageTemperature,AverageTemperatureUncertainty,city,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,ÅRHUS,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,ÅRHUS,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,ÅRHUS,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,ÅRHUS,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,ÅRHUS,Denmark,57.05N,10.33E

In [56]:
df_spark_temp_us = df_spark_temp.filter(df_spark_temp.Country.contains('United States'))

In [57]:
df_spark_temp_us.select('Country').distinct().show()

+-------------+
|      Country|
+-------------+
|United States|
+-------------+

In [58]:
df_city_demograph.limit(5).toPandas()

,City,State,Median Age,Male Population,Female Population,Total Population,Number of Veterans,Foreign-born,Average Household Size,State Code,Race,Count
0,SILVER SPRING,Maryland,33.8,40601,41862,82463,1562,30908,2.6,MD,Hispanic or Latino,25924
1,QUINCY,Massachusetts,41.0,44129,49500,93629,4147,32935,2.39,MA,White,58723
2,HOOVER,Alabama,38.5,38040,46799,84839,4819,8229,2.58,AL,Asian,4759
3,RANCHO CUCAMONGA,California,34.5,88127,87105,175232,5821,33878,3.18,CA,Black or African-American,24437
4,NEWARK,New Jersey,34.6,138040,143873,281913,5829,86253,2.73,NJ,White,76402

In [59]:
df_city_demograph = df_city_demograph.withColumnRenamed('City','us_city')

In [88]:
#some_table= df_spark_temp.join(df_city_demograph, (df_spark_temp_us.city == df_city_demograph.us_city))\
 #       .select(col('dt'), col('AverageTemperature'), col('AverageTemperatureUncertainty'), 
  #              col('us_city'), col('state'), col('Country'), col('Latitude'), col('Longitude'))

In [89]:
#some_table.limit(5).toPandas()

In [85]:
#some_table.count()

In [86]:
#some_table = some_table.dropDuplicates()

In [84]:
#some_table.count()

In [83]:
#some_table.filter(col('AverageTemperature').isNull()).show()

In [82]:
#some_table.filter(col('us_city') == 'ARLINGTON').toPandas()

In [66]:
some_table.filter(col('AverageTemperature').isNull()).count()

30926

In [67]:
828023 - 30926

797097

In [68]:
some_table = some_table.dropna()

In [154]:
some_table.select([count(when(isnan(cc) | col(cc).isNull(), cc)).alias(cc) for cc in some_table.columns]).toPandas()

,dt,AverageTemperature,AverageTemperatureUncertainty,us_city,state,Country,Latitude,Longitude
0,0,0,0,0,0,0,0,0

In [155]:
some_table.count()

797097

In [91]:
df_spark_temp.limit(5).toPandas()

,dt,AverageTemperature,AverageTemperatureUncertainty,city,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,ÅRHUS,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,ÅRHUS,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,ÅRHUS,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,ÅRHUS,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,ÅRHUS,Denmark,57.05N,10.33E

In [193]:
dfImmig.limit(5).toPandas()

,cicid,i94yr,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,...,departure_date,origin_country,port,address,duration_of_stay,visa_purpose,arrival_mode,port_type,us_state,us_state_1
0,5748517.0,2016.0,245.0,438.0,LOS,20574.0,1.0,CA,20582.0,40.0,...,2016-05-08T00:00:00,AUSTRALIA,LOS ANGELES,CALIFORNIA,8,business,air,airport,CALIFORNIA,CALIFORNIA
1,5748518.0,2016.0,245.0,438.0,LOS,20574.0,1.0,NV,20591.0,32.0,...,2016-05-17T00:00:00,AUSTRALIA,LOS ANGELES,NEVADA,17,business,air,airport,CALIFORNIA,CALIFORNIA
2,5748519.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20582.0,29.0,...,2016-05-08T00:00:00,AUSTRALIA,LOS ANGELES,WASHINGTON,8,business,air,airport,CALIFORNIA,CALIFORNIA
3,5748520.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20588.0,29.0,...,2016-05-14T00:00:00,AUSTRALIA,LOS ANGELES,WASHINGTON,14,business,air,airport,CALIFORNIA,CALIFORNIA
4,5748521.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20588.0,28.0,...,2016-05-14T00:00:00,AUSTRALIA,LOS ANGELES,WASHINGTON,14,business,air,airport,CALIFORNIA,CALIFORNIA

In [194]:
fact_immigration_table = dfImmig.join(df_spark_temp, (dfImmig.port == df_spark_temp.city))\
                .filter(col('port').isNotNull())\
                .withColumn('immigration_id', F.row_number().over(Window.orderBy(F.monotonically_increasing_id())))\
                .select(col('port'), col('i94port'), col('arrival_date'), col('port_type'), 
                        col('us_state'), col('AverageTemperature').alias('avg_temperature'))

In [196]:
fact_immigration_table.limit(10).toPandas()

KeyboardInterrupt:

In [80]:
#some_table2 = dfImmig.join(some_table, (dfImmig.port == some_table.us_city))\
#                .filter(col('port').isNotNull())\
 #               .withColumn('immigration_id', F.row_number().over(Window.orderBy(F.monotonically_increasing_id())))\
  #              .withColumn('state', F.upper(col('state')))\
   #             .select(col('port'), col('i94res'), col('arrival_date'), col('port_type'), col('state'), col(''))

In [93]:
fact_immigration_table.limit(5).toPandas()

          port  i94res         arrival_date port_type Latitude Longitude
0  ALBUQUERQUE   582.0  2016-04-28T00:00:00   airport   34.56N   107.03W
1  ALBUQUERQUE   266.0  2016-04-28T00:00:00   airport   34.56N   107.03W
2  ALBUQUERQUE   266.0  2016-04-28T00:00:00   airport   34.56N   107.03W
3  ALBUQUERQUE   582.0  2016-04-28T00:00:00   airport   34.56N   107.03W
4  ALBUQUERQUE   266.0  2016-04-28T00:00:00   airport   34.56N   107.03W

In [112]:
dff.limit(5).toPandas()

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates,state,port_state
0,00A,heliport,Total Rf Heliport,11,NA,US,US-PA,Bensalem,00A,None,00A,"-74.93360137939453, 40.07080078125",PA,PENNSYLVANIA
1,00AA,small_airport,Aero B Ranch Airport,3435,NA,US,US-KS,Leoti,00AA,None,00AA,"-101.473911, 38.704022",KS,KANSAS
2,00AK,small_airport,Lowell Field,450,NA,US,US-AK,Anchor Point,00AK,None,00AK,"-151.695999146, 59.94919968",AK,ALASKA
3,00AL,small_airport,Epps Airpark,820,NA,US,US-AL,Harvest,00AL,None,00AL,"-86.77030181884766, 34.86479949951172",AL,ALABAMA
4,00AR,closed,Newport Hospital & Clinic Heliport,237,NA,US,US-AR,Newport,None,None,None,"-91.254898, 35.6087",AR,ARKANSAS

In [116]:
some_tab = dfImmig.join(dff, (dfImmig.address == dff.port_state))\
                .filter(col('port').isNotNull())\
                .withColumn('immigration_id', F.row_number().over(Window.orderBy(F.monotonically_increasing_id())))\
                .select(col('port'), col('i94res'), col('arrival_date'), col('port_type'), col('ident'), col('port_state'))

In [121]:
some_tab.limit(5).toPandas()

          port  i94res         arrival_date port_type    ident  port_state
0  LOS ANGELES   438.0  2016-04-30T00:00:00   airport     WJBK  CALIFORNIA
1  LOS ANGELES   438.0  2016-04-30T00:00:00   airport  US-CA64  CALIFORNIA
2  LOS ANGELES   438.0  2016-04-30T00:00:00   airport  US-1060  CALIFORNIA
3  LOS ANGELES   438.0  2016-04-30T00:00:00   airport  US-1038  CALIFORNIA
4  LOS ANGELES   438.0  2016-04-30T00:00:00   airport  US-0955  CALIFORNIA

In [ ]:
some_tab.count()

In [102]:
fact_immigration_table.count()

7492342957

In [113]:
dfImmig.limit(5).toPandas()

,cicid,i94yr,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,...,i94mon,arrival_date,departure_date,origin_country,port,address,duration_of_stay,visa_purpose,arrival_mode,port_type
0,5748517.0,2016.0,245.0,438.0,LOS,20574.0,1.0,CA,20582.0,40.0,...,4.0,2016-04-30T00:00:00,2016-05-08T00:00:00,AUSTRALIA,LOS ANGELES,CALIFORNIA,8,business,air,airport
1,5748518.0,2016.0,245.0,438.0,LOS,20574.0,1.0,NV,20591.0,32.0,...,4.0,2016-04-30T00:00:00,2016-05-17T00:00:00,AUSTRALIA,LOS ANGELES,NEVADA,17,business,air,airport
2,5748519.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20582.0,29.0,...,4.0,2016-04-30T00:00:00,2016-05-08T00:00:00,AUSTRALIA,LOS ANGELES,WASHINGTON,8,business,air,airport
3,5748520.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20588.0,29.0,...,4.0,2016-04-30T00:00:00,2016-05-14T00:00:00,AUSTRALIA,LOS ANGELES,WASHINGTON,14,business,air,airport
4,5748521.0,2016.0,245.0,438.0,LOS,20574.0,1.0,WA,20588.0,28.0,...,4.0,2016-04-30T00:00:00,2016-05-14T00:00:00,AUSTRALIA,LOS ANGELES,WASHINGTON,14,business,air,airport

In [ ]:
fact_immigration_table.select([count(when(isnan(cc) | col(cc).isNull(), cc)).alias(cc) for cc in fact_immigration_table.columns]).toPandas()